import os from 'os';
import fs from 'fs';

export default {
  id: ['menu', 'allmenu', 'listmenu', '8643665'],
  run: async ({ client, m, username, runtime, userdb, command }) => {
  let listmenu
  let more = String.fromCharCode(8206);
  let readmore = more.repeat(4001);
  let recode = nodelete
  let infouser = readmore + `╔┅━━―ᡣ𐭩─┈┈┈─―「 *ɪɴꜰᴏ ʙᴏᴛ* 」───────┈┈ᡣ𐭩──╕_
╠─────―────────―─────―─────―────―──
│   Nama Creator : *${author}*
│   OS running : *${os.platform()}*
┃   Runtime  Bot : ${runtime(process.uptime())} 
┃   Total user : -
╠◌𑀈.━━┈┈────୨「 *ɪɴꜰᴏ ᴜꜱᴇʀ* 」ৎ─────―─┈┈──•
┃   Premium user : *${userdb.Premium ? "yes" : "no"}*
┃   User : *${username}*
│   Cloverbits : 0
╽   Hit : ${userdb.hitcmd}
╚━┈┈───────━━━━• ▹▹▹`

  listmenu = `   
   
ʜᴀʟᴏ! ☘️ ꜱᴀʏᴀ ᴀᴅᴀʟᴀʜ (ʙᴏᴛ ᴡʜᴀᴛꜱᴀᴩᴩ) ᴏᴛᴏᴍᴀᴛɪꜱ yᴀɴɢ ᴅᴀᴩᴀᴛ ᴍᴇᴍʙᴀɴᴛᴜ ᴍᴇʟᴀᴋᴜᴋᴀɴ ꜱᴇꜱᴜᴀᴛᴜ, ᴍᴇɴᴄᴀʀɪ ᴅᴀɴ ᴍᴇɴᴅᴀᴩᴀᴛᴋᴀɴ ᴅᴀᴛᴀ ᴀᴛᴀᴜ ɪɴꜰᴏʀᴍᴀꜱɪ ᴍᴇʟᴀʟᴜɪ ᴡʜᴀᴛꜱᴀᴩᴩ.

╔在𑁥───── 「 ɢʀᴏᴜᴘ ᴍᴇɴᴜ 」 ────── • • •
┊  ┏┈┈─────━○∙··
┊  ┊  ◦  revoke
│  ┊  ◦  kick
│  │  ◦  promote
│  │  ◦  demote
│  │  ◦  closegc
│  │  ◦  opengc
│  │  ◦  linkgc
│  │  ◦  editsubjek
│  │  ◦  editdesk
│  │  ◦  welcome
│  │  ◦  setwelcome
│  │  ◦  setgoodbye
│  │  ◦  setpromote
│  │  ◦  setdemote
│  │  ◦  dellppgc
│  │  ◦  delete
│  │  ◦  leavegc
│  │  ◦  listgc
│  │  ◦  ban
│  │  ◦  unban
│  │  ◦  editdesk
┊  │  ◦  joingc
┊  ┊  ◦  editgroup
┊  ┊  ◦  tagall
│  └━──┈┈┈𐔌 . ⋮ ˶• ༝ •˶ ♡ ֹ ₊ ꒱────◌𑀈._
╚━͜͡}─══━━━──────────━━━━══───͜͡}━༻¨*:·

╔在𑁥───── 「 ᴏᴡɴᴇʀ ᴍᴇɴᴜ 」 ────── • • •
┊  ┏┈┈─────━○∙··
┊  ┊  ◦  getsession
│  ┊  ◦  delsession
│  │  ◦  autoread
│  │  ◦  delplugin
│  │  ◦  addplugin
│  │  ◦  delfile
│  │  ◦  getfile
│  │  ◦  getplugin
│  │  ◦  tree
│  │  ◦  findplugin
│  │  ◦  plugininfo
│  │  ◦  editplugin
│  │  ◦  editfile
│  │  ◦  public 
│  │  ◦  $
│  │  ◦  =>
│  │  ◦  >>
│  │  ◦  listowner
│  │  ◦  listprem
│  │  ◦  addowner
│  │  ◦  addprem
│  │  ◦  delowner
│  │  ◦  delprem
┊  │  ◦  restart
┊  ┊  ◦  shutdown
│  └━──┈┈┈𐔌 . ⋮ .ꉂ ˵˃ ᗜ ˂˵ . ₊ ꒱────◌𑀈._
╚━͜͡}─══━━━──────────━━━━══───͜͡}━༻¨*:·

╔在𑁥───── 「 ᴛᴏᴏʟꜱ ᴍᴇɴᴜ 」 ────── • • •
┊  ┏┈┈─────━○∙··
┊  ┊  ◦  toptt
│  ┊  ◦  toaudio
│  │  ◦  tovid
│  │  ◦  get
│  │  ◦  qc
│  │  ◦  iqc
│  │  ◦  remini
│  │  ◦  play
│  │  ◦  cls
│  │  ◦  post
│  │  ◦  kalulator
┊  │  ◦  toimg
┊  ┊  ◦  sticker
│  └━──┈┈┈𐔌 . ⋮  ˶ᵔ ᵕ ᵔ˶ .ᐟ ֹ ₊ ꒱────◌𑀈._
╚━͜͡}─══━━━──────────━━━━══───͜͡}━༻¨*:·

╔在𑁥───── 「 ᴍᴀɪɴ ᴍᴇɴᴜ 」 ────── • • •
┊  ┏┈┈─────━○∙··
┊  ┊  ◦  runtime
│  │  ◦  sc
│  │  ◦  owner
┊  ┊  ◦  credits
│  └━──┈┈┈𐔌 . ⋮ ｡•̀ ᴗ - ✧ ֹ ₊ ꒱────◌𑀈._
╚━͜͡}─══━━━──────────━━━━══───͜͡}━༻¨*:·

╔在𑁥───── 「 ᴅᴏᴡɴʟᴏᴀᴅᴇʀ ᴍᴇɴᴜ 」 ────── • • •
┊  ┏┈┈─────━○∙··
┊  ┊  ◦  tiktok
│  ┊  ◦  youtube
│  │  ◦  gdrive
│  │  ◦  facebook
│  │  ◦  soundcloud
│  │  ◦  gitclone
│  │  ◦  twitter
│  │  ◦  spotify
│  │  ◦  douyin
│  │  ◦  mediafire
│  │  ◦  pinterest
┊  │  ◦  xiaohongshu
┊  ┊  ◦  instagram
│  └━──┈┈┈𐔌 . ⋮  ˃ ⤙ ˂  ֹ ₊ ꒱────◌𑀈._
╚━͜͡}─══━━━──────────━━━━══───͜͡}━༻¨*:·

╔在𑁥───── 「 ᴅᴏᴡɴʟᴏᴀᴅᴇʀ ᴍᴇɴᴜ 」 ────── • • •
┊  ┏┈┈─────━○∙··
┊  ┊  ◦  bass
│  ┊  ◦  blown
│  │  ◦  deep
│  │  ◦  earrape
│  │  ◦  fast
│  │  ◦  fat
│  │  ◦  nightcore
│  │  ◦  reverse
│  │  ◦  robot
│  │  ◦  slow
┊  │  ◦  smooth
┊  ┊  ◦  tupai
│  └━──┈┈┈𐔌 . ⋮  ｡ •́︿• ̀｡  ֹ ₊ ꒱────◌𑀈._
╚━͜͡}─══━━━──────────━━━━══───͜͡}━༻¨*:·
`

  await client.sendMessage(m.chat, {
    text: infouser + listmenu,
    contextInfo: {
      mentionedJid: [m.sender],
      isForwarded: true,
      forwardedNewsletterMessageInfo: {
        newsletterJid: ids,
        serverMessageId: null,
        newsletterName: nems
      },
      externalAdReply: {
        body: body,
        thumbnail: thumb1,
        mediaType: 1,
        renderLargerThumbnail: true
      }
    }
  })
 }
}
